In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
file_path = "C:\\Users\\DBRok\\Downloads\\Visadataset.csv"

visa_df = pd.read_csv(file_path)

visa_df.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [4]:
dict1 = {'Name':['Ram','Sita','Laxman',np.nan],
         'Age':[30,31,np.nan,33],
         'City':[np.nan,'Hyd','Pune','Chennai']}

pd.DataFrame(dict1)

     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai

In [5]:
dict1 = {'Name':['Ram','Sita','Laxman',None],
         'Age':[30,31,None,33],
         'City':[None,'Hyd','Pune','Chennai']}

pd.DataFrame(dict1)

# as you can see in age column NaN is coming so np.nan is recomended.

     Name   Age     City
0     Ram  30.0     None
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3    None  33.0  Chennai

In [6]:
# Recommended
dict1 = {'Name':['Ram','Sita','Laxman',np.nan],
         'Age':[30,31,np.nan,33],
         'City':[np.nan,'Hyd','Pune','Chennai']}

df = pd.DataFrame(dict1)
df

     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai

**Method-01:**

*Fill with a random number to all Null Values*

In [7]:
df.isnull()

    Name    Age   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [10]:
df.isnull().sum().count()

3

In [9]:
df.isna()  # isnull and this one both are same.

    Name    Age   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

**fillna**

In [12]:
df.fillna(40, inplace=True) # in place true means you are updating df.

In [13]:
df

     Name   Age     City
0     Ram  30.0       40
1    Sita  31.0      Hyd
2  Laxman  40.0     Pune
3      40  33.0  Chennai

**Method-2**

*Fill the random value by using column wise*

In [14]:
########### Read the data again #############
dict1 = {'Name':['Ram','Sita','Laxman',np.nan],
         'Age':[30,31,np.nan,33],
         'City':[np.nan,'Hyd','Pune','Chennai']}

df = pd.DataFrame(dict1)
df

     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai

In [17]:
df['Name'].fillna("Raheem", inplace=True)
df['Age'].fillna(32, inplace=True) # based on data type provide the values
df['City'].fillna("Banglore", inplace=True)

df

C:\Users\DBRok\AppData\Local\Temp\ipykernel_8392\2796604841.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(32, inplace=True) # based on data type provide the values
C:\Users\DBRok\AppData\Local\Temp\ipykernel_8392\2796604841.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['City'].fillna("Banglore", inplace=True)

     Name   Age      City
0     Ram  30.0  Banglore
1    Sita  31.0       Hyd
2  Laxman  32.0      Pune
3  Raheem  33.0   Chennai

**Method-03**

- pad 

- bfill 

- backfill 

- ffill

In [18]:
########### Read the data again #############
dict1 = {'Name':['Ram','Sita','Laxman',np.nan],
         'Age':[30,31,np.nan,33],
         'City':[np.nan,'Hyd','Pune','Chennai']}

df = pd.DataFrame(dict1)
df

     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai

In [25]:
print("=========== Orginial ===========")
print(df)

print("============= pad ============")
print(df.fillna(method='pad')) 

print("============= bfill ============")
print(df.fillna(method='bfill'))

print("============= backfill ============")
print(df.fillna(method='backfill'))

print("============= ffill ============")
print(df.fillna(method='ffill'))

=========== Orginial ===========
     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai
============= pad ============
     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman  31.0     Pune
3  Laxman  33.0  Chennai
============= bfill ============
     Name   Age     City
0     Ram  30.0      Hyd
1    Sita  31.0      Hyd
2  Laxman  33.0     Pune
3     NaN  33.0  Chennai
============= backfill ============
     Name   Age     City
0     Ram  30.0      Hyd
1    Sita  31.0      Hyd
2  Laxman  33.0     Pune
3     NaN  33.0  Chennai
============= ffill ============
     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman  31.0     Pune
3  Laxman  33.0  Chennai

C:\Users\DBRok\AppData\Local\Temp\ipykernel_8392\2525957940.py:5: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(df.fillna(method='pad'))
C:\Users\DBRok\AppData\Local\Temp\ipykernel_8392\2525957940.py:8: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(df.fillna(method='bfill'))
C:\Users\DBRok\AppData\Local\Temp\ipykernel_8392\2525957940.py:11: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(df.fillna(method='backfill'))
C:\Users\DBRok\AppData\Local\Temp\ipykernel_8392\2525957940.py:14: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(df.fillna(method='ffill'))

In [26]:
# axis=1 means your data frame is rotated

print("=========== Orginial ===========")
print(df)

print("============= pad ============")
print(df.fillna(method='pad', axis=1)) 

print("============= bfill ============")
print(df.fillna(method='bfill', axis=1))

print("============= backfill ============")
print(df.fillna(method='backfill', axis=1))

print("============= ffill ============")
print(df.fillna(method='ffill', axis=1))

=========== Orginial ===========
     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai
============= pad ============
     Name     Age     City
0     Ram    30.0     30.0
1    Sita    31.0      Hyd
2  Laxman  Laxman     Pune
3     NaN    33.0  Chennai
============= bfill ============
     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman  Pune     Pune
3    33.0  33.0  Chennai
============= backfill ============
     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman  Pune     Pune
3    33.0  33.0  Chennai
============= ffill ============
     Name     Age     City
0     Ram    30.0     30.0
1    Sita    31.0      Hyd
2  Laxman  Laxman     Pune
3     NaN    33.0  Chennai

C:\Users\DBRok\AppData\Local\Temp\ipykernel_8392\2529822625.py:7: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(df.fillna(method='pad', axis=1))
C:\Users\DBRok\AppData\Local\Temp\ipykernel_8392\2529822625.py:10: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(df.fillna(method='bfill', axis=1))
C:\Users\DBRok\AppData\Local\Temp\ipykernel_8392\2529822625.py:13: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(df.fillna(method='backfill', axis=1))
C:\Users\DBRok\AppData\Local\Temp\ipykernel_8392\2529822625.py:16: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(df.fillna(method='ffill', axis=1))

$Method-4$:
    
- Mean

- Median

- Mode

In [27]:
################## Read the data agian #####################
dict1 = {'Name':['Ram','Sita','Laxman',np.nan],
         'Age':[30,31,np.nan,33],
         'City':[np.nan,'Hyd','Pune','Chennai']}

df=pd.DataFrame(dict1)
df

     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Laxman   NaN     Pune
3     NaN  33.0  Chennai

In [28]:
mean_age = df['Age'].mean()

df['Age'].fillna(mean_age)

0    30.000000
1    31.000000
2    31.333333
3    33.000000
Name: Age, dtype: float64

In [29]:
median_age = df['Age'].median()

df['Age'].fillna(median_age)

0    30.0
1    31.0
2    31.0
3    33.0
Name: Age, dtype: float64

- Mode is used for categorical Data 

- Mean and Median is used for numerical data